# Bonus: Temperature Analysis I

In [1]:
import pandas as pd
from datetime import datetime as dt

In [2]:
# "tobs" is "temperature observations"
df = pd.read_csv('Resources/hawaii_measurements.csv')
df.head()

       station        date  prcp  tobs
0  USC00519397  2010-01-01  0.08    65
1  USC00519397  2010-01-02  0.00    63
2  USC00519397  2010-01-03  0.00    74
3  USC00519397  2010-01-04  0.00    76
4  USC00519397  2010-01-06   NaN    73

In [11]:
# Convert the date column format from string to datetime
df['date'] = pd.to_datetime(df['date'], format='%Y%m%d')

In [12]:
# Set the date column as the DataFrame index
df_index = df.set_index(['date'])
df_index.head()

                station  prcp  tobs
date
2010-01-01  USC00519397  0.08    65
2010-01-02  USC00519397  0.00    63
2010-01-03  USC00519397  0.00    74
2010-01-04  USC00519397  0.00    76
2010-01-06  USC00519397   NaN    73

In [13]:
# Drop the date column
df_new= df_index.reset_index(inplace=True)
df_new

### Compare June and December data across all years

In [6]:
from scipy import stats

In [15]:
# Filter data for desired months
df_index['year'] = pd.DatetimeIndex(df['date']).year
df_index['month'] = pd.DatetimeIndex(df['date']).month
df_index.head()

        date      station  prcp  tobs  year  month
0 2010-01-01  USC00519397  0.08    65  2010      1
1 2010-01-02  USC00519397  0.00    63  2010      1
2 2010-01-03  USC00519397  0.00    74  2010      1
3 2010-01-04  USC00519397  0.00    76  2010      1
4 2010-01-06  USC00519397   NaN    73  2010      1

In [16]:
# Filter data for desired months June
june_df = df_index.loc[df_index['month'] == 6]
june_df.head()

          date      station  prcp  tobs  year  month
133 2010-06-01  USC00519397  0.00    78  2010      6
134 2010-06-02  USC00519397  0.01    76  2010      6
135 2010-06-03  USC00519397  0.00    78  2010      6
136 2010-06-04  USC00519397  0.00    76  2010      6
137 2010-06-05  USC00519397  0.00    77  2010      6

In [17]:
# Filter data for desired months December
dec_df = df_index.loc[df_index['month'] == 12]
dec_df.head()

          date      station  prcp  tobs  year  month
305 2010-12-01  USC00519397  0.04    76  2010     12
306 2010-12-03  USC00519397  0.00    74  2010     12
307 2010-12-04  USC00519397  0.00    74  2010     12
308 2010-12-06  USC00519397  0.00    64  2010     12
309 2010-12-07  USC00519397  0.00    64  2010     12

In [23]:
# Identify the average temperature for June
average_temp_by_year_june = june_df.groupby('station')['tobs'].mean()
average_temp_by_year_june.head()

station
USC00511918    74.139394
USC00513117    74.050847
USC00514830    76.005376
USC00516128    71.937220
USC00517948    76.655405
Name: tobs, dtype: float64

In [24]:
# Identify the average temperature for December
average_temp_by_year_dec = dec_df.groupby('station')['tobs'].mean()
average_temp_by_year_dec.head()

station
USC00511918    69.684211
USC00513117    71.069444
USC00514830    73.224719
USC00516128    69.291262
USC00517948    71.834862
Name: tobs, dtype: float64

In [27]:
#Create Dataframe
average_df = pd.DataFrame({
    "station": ["USC00511918", "USC00513117", "USC00514830", "USC00516128", "USC00517948"],
    "June": [74.139394, 74.050847, 76.005376, 71.937220, 76.655405],
    "Dec": [69.684211, 71.069444, 73.224719, 69.291262, 71.834862]
})
average_df

       station       June        Dec
0  USC00511918  74.139394  69.684211
1  USC00513117  74.050847  71.069444
2  USC00514830  76.005376  73.224719
3  USC00516128  71.937220  69.291262
4  USC00517948  76.655405  71.834862

In [25]:
from scipy.stats import ttest_rel

In [29]:
# Run paired t-test
stats.ttest_ind(average_df['June'] , average_df['Dec'] , equal_var=False)

Ttest_indResult(statistic=3.2222227192894533, pvalue=0.012541988581165424)

## Analysis

### A paired t-test is designed to compare the means of the same group or item under two separate scenarios. This i believe suits the data as they are from the same data base (same group) but for two differnt months (separate scenarios). 


### Higher values of the t-value,  indicate that a large difference exists between the two sample sets. The smaller the t-value, the more similarity exists between the two sample sets

### A p-value less than 0.05 (typically â‰¤ 0.05) is statistically significant. It indicates strong evidence against the null hypothesis, as there is less than a 5% probability the null is correct (and the results are random). Therefore, we reject the null hypothesis, and accept the alternative hypothesis.

### Given our P Values of 0.0125, we can conclude that it the average temperatures are statistically significant.